{
	"version": "https://jsonfeed.org/version/1",
	"title": "Richard Tolhurst Smith",
	"icon": "https://micro.blog/rts/avatar.jpg",
	"home_page_url": "https://tolhurst.org/",
	"feed_url": "https://tolhurst.org/feed.json",
	"items": [
		
			{
				"id": "http://rts.micro.blog/2026/01/28/brave-browser-is-great-for.html",
				
				"content_html": "<p>Brave browser is great for adblocking and privacy but on iOS it leaks memory so badly I can&rsquo;t use it anymore. May not be Brave&rsquo;s fault entirely - Safari leaks too, and I think they are forced to use Apple&rsquo;s engine on iOS. But the out of memory crashes and loss of tabs have forced me back to Firefox.</p>\n",
				"content_text": "Brave browser is great for adblocking and privacy but on iOS it leaks memory so badly I can't use it anymore. May not be Brave's fault entirely - Safari leaks too, and I think they are forced to use Apple's engine on iOS. But the out of memory crashes and loss of tabs have forced me back to Firefox.\n",
				"date_published": "2026-01-28T12:00:24+00:00",
				"url": "https://tolhurst.org/2026/01/28/brave-browser-is-great-for.html"
			},
			{
				"id": "http://rts.micro.blog/2026/01/22/an-os-for-a-powerpc.html",
				"title": "An OS for a PowerPC Macintosh",
				"content_html": "<p>Apple has used four different CPU architectures for its Macintosh computers.  The second, used around the turn of the century, was PowerPC.  I have an iMac with a G5.  It&rsquo;s not quite as powerful as the G5 Mac Pro, or indeed even a modern Raspberry Pi, but with 1 GB of RAM it <strong>ought</strong> to be able still to run many useful applications rather than being consigned to the scrapheap.</p>\n<p>However, what it can run is dependent on its operating system. So which one to choose?</p>\n<h2 id=\"macos-104-tiger\">MacOS 10.4 Tiger</h2>\n<p>The original OS supplied with the machine looks nice and runs fast, but there is little software available. There&rsquo;s no iTerm and the Terminal.app is poor even for running terminal apps. There is a &lsquo;tiger brew&rsquo; fork of Homebrew available with some modern programs but they take a long time to compile.</p>\n<h2 id=\"macos-105-leopard\">Macos 10.5 Leopard</h2>\n<p>Also officially supported by Apple, it runs a little slower but has more features. There is a &lsquo;Sorbet Leopard&rsquo; modded version available that streamlines and backports features amd seems to work well. There&rsquo;s iTerm2 and Terminal.app is better so this could be usable as a remote terminal. There&rsquo;s ChickenVNC for running apps remotely but I could&rsquo;t get it to work with modern VNC servers. There&rsquo;s a PPC fork of Macports available - I haven&rsquo;t tried but it says 10.6 is preferred for Macports. There&rsquo;s a web-browser, Aquafox, but support for modern websites is pretty limited.</p>\n<h2 id=\"macos-106-snow-leopard\">Macos 10.6 Snow Leopard</h2>\n<p>Never officially released for PPC chips, only for Intel, there is a hacked version based on a preview release from before PPC support was removed. This is the recommended OS for Macports but unfortunately I found it to be very unstable and can&rsquo;t recommend it.</p>\n<h2 id=\"adelie-linux\">Adelie Linux</h2>\n<p>This obscure distro seems to be the most recommended for PPC support. (Debian still builds for PPC in Sid but doesn&rsquo;t publish releases.) To my surprise it does actually work (provided you install &lsquo;beta 5&rsquo; and not the latest &lsquo;beta 6&rsquo;) ! And for terminal usage it&rsquo;s pretty good - you get a full modern terminal. However X11 graphics acceleration doesn&rsquo;t work. So any desktop apps are frustrating slow.  There are reports of old drivers that did work, and source code patches that might work, but currently no-one cares about PPC platform enough to actually debug this. Perhaps as a consequence of this, Firefox (the supplied browser) won&rsquo;t even run.  Also the Grub bootloader doesn&rsquo;t install properly and requires manual intervention to boot.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>So for terminal work, MacOS 10.5 and Adelie Linux are both acceptable. Beyond that nothing is really usable.</p>\n<h2 id=\"to-do\">To do:</h2>\n<p>Try to find software that runs on Linux framebuffer, perhaps a VNC client, which may run faster than using the usual X11 desktop.</p>\n<p>Try MorphOS.</p>\n",
				"content_text": "Apple has used four different CPU architectures for its Macintosh computers.  The second, used around the turn of the century, was PowerPC.  I have an iMac with a G5.  It's not quite as powerful as the G5 Mac Pro, or indeed even a modern Raspberry Pi, but with 1 GB of RAM it **ought** to be able still to run many useful applications rather than being consigned to the scrapheap.\n\nHowever, what it can run is dependent on its operating system. So which one to choose?\n\n## MacOS 10.4 Tiger\n\nThe original OS supplied with the machine looks nice and runs fast, but there is little software available. There's no iTerm and the Terminal.app is poor even for running terminal apps. There is a 'tiger brew' fork of Homebrew available with some modern programs but they take a long time to compile.\n\n## Macos 10.5 Leopard\n\nAlso officially supported by Apple, it runs a little slower but has more features. There is a 'Sorbet Leopard' modded version available that streamlines and backports features amd seems to work well. There's iTerm2 and Terminal.app is better so this could be usable as a remote terminal. There's ChickenVNC for running apps remotely but I could't get it to work with modern VNC servers. There's a PPC fork of Macports available - I haven't tried but it says 10.6 is preferred for Macports. There's a web-browser, Aquafox, but support for modern websites is pretty limited.\n\n## Macos 10.6 Snow Leopard\n\nNever officially released for PPC chips, only for Intel, there is a hacked version based on a preview release from before PPC support was removed. This is the recommended OS for Macports but unfortunately I found it to be very unstable and can't recommend it.\n\n## Adelie Linux\n\nThis obscure distro seems to be the most recommended for PPC support. (Debian still builds for PPC in Sid but doesn't publish releases.) To my surprise it does actually work (provided you install 'beta 5' and not the latest 'beta 6') ! And for terminal usage it's pretty good - you get a full modern terminal. However X11 graphics acceleration doesn't work. So any desktop apps are frustrating slow.  There are reports of old drivers that did work, and source code patches that might work, but currently no-one cares about PPC platform enough to actually debug this. Perhaps as a consequence of this, Firefox (the supplied browser) won't even run.  Also the Grub bootloader doesn't install properly and requires manual intervention to boot.\n\n## Conclusion\n\nSo for terminal work, MacOS 10.5 and Adelie Linux are both acceptable. Beyond that nothing is really usable.\n\n## To do:\n\nTry to find software that runs on Linux framebuffer, perhaps a VNC client, which may run faster than using the usual X11 desktop.\n\nTry MorphOS.\n",
				"date_published": "2026-01-22T19:14:55+00:00",
				"url": "https://tolhurst.org/2026/01/22/an-os-for-a-powerpc.html"
			},
			{
				"id": "http://rts.micro.blog/2025/12/04/there-have-been-several-c.html",
				
				"content_html": "<p>There have been several C compilers for 8 bit CPUs but the language was just so ill suited you’d be better advised to use Pascal if you needed a high level language with good performance. Just found <a href=\"https://github.com/drmortalwombat/oscar64\">github.com/drmortalw&hellip;</a> which claims to approach the performance of ASM.</p>\n",
				"content_text": "There have been several C compilers for 8 bit CPUs but the language was just so ill suited you’d be better advised to use Pascal if you needed a high level language with good performance. Just found [github.com/drmortalw...](https://github.com/drmortalwombat/oscar64) which claims to approach the performance of ASM. \n",
				"date_published": "2025-12-04T10:38:40+00:00",
				"url": "https://tolhurst.org/2025/12/04/there-have-been-several-c.html"
			},
			{
				"id": "http://rts.micro.blog/2025/12/04/apple-just-dont-seem-capable.html",
				
				"content_html": "<p>Apple just don’t seem capable of writing an IPv6 stack that isn’t buggy. My 20 year old iMac recently started crashing every 30 seconds. What changed? It picked up a v6 address.</p>\n",
				"content_text": "Apple just don’t seem capable of writing an IPv6 stack that isn’t buggy. My 20 year old iMac recently started crashing every 30 seconds. What changed? It picked up a v6 address. \n",
				"date_published": "2025-12-04T05:14:45+00:00",
				"url": "https://tolhurst.org/2025/12/04/apple-just-dont-seem-capable.html"
			},
			{
				"id": "http://rts.micro.blog/2025/12/04/appletv-has-no-option-to.html",
				
				"content_html": "<p>AppleTV has no option to disable IPv6. It has the usual options to configure IPv4 addresses, but nothing for 6. Why does it matter? Because if the thing gets allocated a v6 address by the router it uses so much CPU that it can’t decide h265 video in real-time anymore.</p>\n",
				"content_text": "AppleTV has no option to disable IPv6. It has the usual options to configure IPv4 addresses, but nothing for 6. Why does it matter? Because if the thing gets allocated a v6 address by the router it uses so much CPU that it can’t decide h265 video in real-time anymore.\n",
				"date_published": "2025-12-04T05:12:52+00:00",
				"url": "https://tolhurst.org/2025/12/04/appletv-has-no-option-to.html"
			},
			{
				"id": "http://rts.micro.blog/2025/11/26/a-lot-of-software-perhaps.html",
				
				"content_html": "<p>A lot of software - perhaps the majority of software - is written in the wrong language because “what language is the developer most familiar with” was a more important consideration than “what language is best for this project”.</p>\n",
				"content_text": "A lot of software - perhaps the majority of software - is written in the wrong language because “what language is the developer most familiar with” was a more important consideration than “what language is best for this project”. \n",
				"date_published": "2025-11-26T13:18:26+00:00",
				"url": "https://tolhurst.org/2025/11/26/a-lot-of-software-perhaps.html"
			},
			{
				"id": "http://rts.micro.blog/2025/11/25/i-was-quite-excited-to.html",
				
				"content_html": "<p>I was quite excited to see Settlers 2 is getting an Amiga port. Then I saw the minimum specs required are higher than any Amiga that ever shipped! So who is this for, running only on Franken-Amigas, FPGAs and emulators? A500/A1200 port please. <a href=\"https://lookbehindyou.de/en/product/thesettlers2amiga/\">lookbehindyou.de/en/produc&hellip;</a></p>\n",
				"content_text": "I was quite excited to see Settlers 2 is getting an Amiga port. Then I saw the minimum specs required are higher than any Amiga that ever shipped! So who is this for, running only on Franken-Amigas, FPGAs and emulators? A500/A1200 port please. [lookbehindyou.de/en/produc...](https://lookbehindyou.de/en/product/thesettlers2amiga/)\n",
				"date_published": "2025-11-25T03:21:58+00:00",
				"url": "https://tolhurst.org/2025/11/25/i-was-quite-excited-to.html"
			},
			{
				"id": "http://rts.micro.blog/2025/11/22/you-should-never-buy-from.html",
				
				"content_html": "<p>You should never buy from John Lewis. Their behaviour is so egregiously bad no amount of 1 star reviews would cover it, yet it doesn’t get reported in the press so most are unaware. <a href=\"https://old.reddit.com/r/LegalAdviceUK/comments/1p42jzw/update_john_lewis_ipad_non_delivery_claim_england/\">old.reddit.com/r/LegalAd&hellip;</a></p>\n",
				"content_text": "You should never buy from John Lewis. Their behaviour is so egregiously bad no amount of 1 star reviews would cover it, yet it doesn’t get reported in the press so most are unaware. [old.reddit.com/r/LegalAd...](https://old.reddit.com/r/LegalAdviceUK/comments/1p42jzw/update_john_lewis_ipad_non_delivery_claim_england/)\n",
				"date_published": "2025-11-22T21:48:24+00:00",
				"url": "https://tolhurst.org/2025/11/22/you-should-never-buy-from.html"
			},
			{
				"id": "http://rts.micro.blog/2025/11/22/apparently-the-steam-frame-vr.html",
				
				"content_html": "<p>Apparently the Steam Frame VR headset will have perfect x86 emulation on ARM. That’s cool; it means the next Steam Deck could be ARM and so be cheaper/faster/lighter. But what about if a dev wants to avoid the emulation, can they ship native binaries? <a href=\"https://www.igalia.com/2025/11/helpingvalve.html\">www.igalia.com/2025/11/h&hellip;</a></p>\n",
				"content_text": "Apparently the Steam Frame VR headset will have perfect x86 emulation on ARM. That’s cool; it means the next Steam Deck could be ARM and so be cheaper/faster/lighter. But what about if a dev wants to avoid the emulation, can they ship native binaries? [www.igalia.com/2025/11/h...](https://www.igalia.com/2025/11/helpingvalve.html)\n",
				"date_published": "2025-11-22T17:48:28+00:00",
				"url": "https://tolhurst.org/2025/11/22/apparently-the-steam-frame-vr.html"
			},
			{
				"id": "http://rts.micro.blog/2025/11/20/has-anyone-managed-to-get.html",
				
				"content_html": "<p>Has anyone managed to get a subscription to Cerebras? They keep announcing but seem to be permanently “sold out”.  <a href=\"https://www.cerebras.ai/blog/glm\">www.cerebras.ai/blog/glm</a> The theory seems to be it isn’t as good as Claude but makes up for it by being faster?</p>\n",
				"content_text": "Has anyone managed to get a subscription to Cerebras? They keep announcing but seem to be permanently “sold out”.  [www.cerebras.ai/blog/glm](https://www.cerebras.ai/blog/glm) The theory seems to be it isn’t as good as Claude but makes up for it by being faster?\n",
				"date_published": "2025-11-20T00:23:51+00:00",
				"url": "https://tolhurst.org/2025/11/20/has-anyone-managed-to-get.html"
			},
			{
				"id": "http://rts.micro.blog/2025/11/19/login-to-website-find-email.html",
				
				"content_html": "<p>Login to website</p>\n<ol>\n<li>Find email address. I usually use unique addresses so this should be enough to identify me?</li>\n<li>Remember my cookies? No it never remembers me.</li>\n<li>Verify email. Wait for it to come through. Annoying</li>\n<li>Verify phone number. What if it lost my phone?</li>\n<li>Enter TOTP code. Quick, before it disappears! Again, what if lost phone?</li>\n</ol>\n<p>Why can’t we just have one digital identify that handles all this?</p>\n",
				"content_text": "Login to website\n1. Find email address. I usually use unique addresses so this should be enough to identify me?\n2. Remember my cookies? No it never remembers me. \n3. Verify email. Wait for it to come through. Annoying\n4. Verify phone number. What if it lost my phone?\n5. Enter TOTP code. Quick, before it disappears! Again, what if lost phone?\n\nWhy can’t we just have one digital identify that handles all this?\n",
				"date_published": "2025-11-19T03:02:00+00:00",
				"url": "https://tolhurst.org/2025/11/19/login-to-website-find-email.html"
			}
	]
}
